blogger/app/controllers/tags_controller.rb

  def destroy
    @tag = Tag.find(params[:id]).destroy
---
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 3]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]